STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/ucpd/demo_application.c
/* Counter for Sel Joystick pressed*/
#if defined(_RTOS)
osMessageQId  LCDMsgBox;
#endif
static int8_t portSel =0;
USBPD_DiscoveryIdentity_TypeDef pIdentity;

/* Private function prototypes -----------------------------------------------*/
static void Display_Selected_port(void);
static void Display_border(void);
static void Display_clear_info(void);
static void Display_debug_port(uint8_t PortNum, uint8_t *msg);

static void Display_sinkcapa_menu(uint8_t PortNum);
static void Display_sinkcapa_menu_nav(uint8_t PortNum, int8_t Or);

static void Display_sourcecapa_menu_nav(uint8_t PortNum, int8_t Or);
static uint8_t  Display_sourcecapa_menu_exec(uint8_t PortNum);

static void Display_extcapa_menu_nav(uint8_t PortNum, int8_t Or);

static void Display_command_menu(uint8_t PortNum);
static void Display_command_menu_nav(uint8_t PortNum, int8_t Or);
static void Display_command_menu_exec(uint8_t PortNum);

static void Display_cableinfo_menu(uint8_t PortNum);

void DEMO_Task(void const *argument);
static void string_completion(uint8_t *Str, uint8_t SizeMax);

/**
  * @brief  Demo BSP initialisation
  * @retval DEMO_ErrorCode status
  */
DEMO_ErrorCode DEMO_InitBSP(void)
{
  GUI_SetFont(&Font12);
 
  /* Clear the LCD */ 
  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_Clear(GUI_COLOR_WHITE);
  
  BSP_LCD_DrawBitmap(DEMO_MAIN_LCD, 0, 0, (uint8_t *)header_data_logo);
  Display_Selected_port();
  Display_border();
  
  /* Initialize Joystick */
  BSP_JOY_Init(JOY1, JOY_MODE_EXTI, JOY_ALL);

  /* Initialize Push Button  */
  BSP_PB_Init(BUTTON_USER , BUTTON_MODE_EXTI);

  return DEMO_OK;
}

/**
  * @brief  Demo Task initialisation
  * @retval DEMO_ErrorCode status
  */
DEMO_ErrorCode DEMO_InitTask()
{
#if defined(_RTOS)
  osMessageQDef(MsgBox, LCD_ALARMBOX_MESSAGES_MAX, uint32_t);

#if defined(_GUI_INTERFACE)
  osThreadDef(LCD, DEMO_Task, osPriorityLow, 0, 240);
#else
  osThreadDef(LCD, DEMO_Task, osPriorityLow, 0, 280);
#endif /*_GUI_INTERFACE*/

  LCDMsgBox = osMessageCreate(osMessageQ(MsgBox), NULL);
  if(NULL == osThreadCreate(osThread(LCD), &LCDMsgBox))
  {
    return DEMO_ERROR;
  }
#endif

  return DEMO_OK;
}

#if defined(_RTOS)
/**
  * @brief  UserCableDetection reporting events on a specified port from CAD layer.
  * @param  PortNum  The handle of the port
  * @param  State    CAD state
  * @param  Cc       The Communication Channel for the USBPD communication
  * @retval None
  */
void DEMO_PostCADMessage(uint8_t PortNum, USBPD_CAD_EVENT State, CCxPin_TypeDef Cc)
{
  uint32_t event = (DEMO_MSG_CAD |  (Cc << DEMO_CAD_CC_NUM_Pos | (PortNum << DEMO_CAD_PORT_NUM_Pos) | State ));
  osMessagePut(LCDMsgBox, event, 0);
}

/**
  * @brief  Callback function called by PE to inform DPM about PE event.
  * @param  PortNum   The handle of the port
  * @param  EventVal  @ref USBPD_NotifyEventValue_TypeDef
  * @retval None
  */
void DEMO_PostNotificationMessage(uint8_t PortNum, USBPD_NotifyEventValue_TypeDef EventVal)
{
  uint32_t event = DEMO_MSG_PENOTIFY | PortNum << DEMO_PE_PORT_NUM_Pos | EventVal;
  osMessagePut(LCDMsgBox, event, 0);
}


/**
  * @brief  Callback function called by PE to inform DPM about PE event.
  * @param  EventVal @ref USBPD_NotifyEventValue_TypeDef
  * @retval None
  */
void DEMO_PostMMIMessage(uint32_t EventVal)
{
  uint32_t event = DEMO_MSG_MMI | EventVal;
  if (joyevent == 0 )
  {
    joyevent = 1;
    (void)osMessagePut(LCDMsgBox, event, 0);
  }
}
#endif

/**
  * @brief  Function used to save cable information .
  * @param  PortNum        The handle of the port
  * @param  pDiscoIdentify Pointer on the VDM discovery identify
  * @retval None
  */
void DEMO_SetCableInfo(uint8_t PortNum, USBPD_DiscoveryIdentity_TypeDef *pDiscoIdentify)
{
  memcpy(&pIdentity, pDiscoIdentify, sizeof(USBPD_DiscoveryIdentity_TypeDef));
}

/**
  * @brief  Display power
  * @retval None
  */
static void Display_power(void)
{
  uint32_t vsense = 0;
  int32_t isense = 0;
  char  pstr[20]={0};
  static uint8_t counter = 0;

  counter++;

  if(counter == 5)
  {
    counter = 0;

    GUI_SetFont(&Font12);
    GUI_SetTextColor(GUI_COLOR_ST_PINK);
    GUI_SetBackColor(GUI_COLOR_WHITE);

    /* Port 0 */
    if(DPM_Ports[USBPD_PORT_0].DPM_IsConnected)
    {
      BSP_USBPD_PWR_VBUSGetVoltage(USBPD_PORT_0, &vsense);
      BSP_USBPD_PWR_VBUSGetCurrent(USBPD_PORT_0, &isense);
      if(isense < 0)
      {
        isense = -isense;
        sprintf(pstr,"%2d.%0.2dV -%1d.%0.2dA",(vsense / 1000), (vsense % 1000)/10, (isense/1000), (isense % 1000)/10);
      }
      else
      {
        sprintf(pstr,"%2d.%0.2dV %1d.%0.2dA",(vsense / 1000), (vsense % 1000)/10, (isense/1000), (isense % 1000)/10);
      }
      
      GUI_DisplayStringAt(64, Font12.Height * 4, (uint8_t*)pstr,LEFT_MODE);
    }
    else
    {
      GUI_DisplayStringAt(64, Font12.Height * 4, (uint8_t*)"                ",LEFT_MODE);
    }
  }
}

/**
  * @brief  Display contract info
  * @param  PortNum The handle of the port
  * @retval None
  */
static void Display_contract_port(uint8_t PortNum)
{
  uint32_t pos;

  GUI_SetFont(&Font16);
  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);

  pos = (PortNum == 0)? 54:181;
  pos = pos +  Font16.Width;

  /* PDX */
  if(DPM_Ports[PortNum].DPM_IsConnected)
  {
    if (USBPD_SPECIFICATION_REV3 == DPM_Params[PortNum].PE_SpecRevision)
    {
      GUI_DisplayStringAt(pos, 10+ Font16.Height, (uint8_t*)"PD3", LEFT_MODE);
    }
    else
    {
      GUI_DisplayStringAt(pos, 10+Font16.Height, (uint8_t*)"PD2", LEFT_MODE);
    }

    /* UFP/DFP */
    if (USBPD_PORTDATAROLE_UFP == DPM_Params[PortNum].PE_DataRole)
    {
      GUI_DisplayStringAt(pos + 38, 10+ Font16.Height, (uint8_t*)"UFP", LEFT_MODE);
    }
    else
    {
      GUI_DisplayStringAt(pos + 38, 10 + Font16.Height, (uint8_t*)"DFP", LEFT_MODE);
    }
  
  }
  else
  {
    GUI_DisplayStringAt(pos, 10+Font16.Height, (uint8_t*)"          ", LEFT_MODE);
  }
}

/**
  * @brief  Display error message
  * @param  PortNum   Port Number
  * @param  ErrorType Demo error type
  * @retval None
  */
void DEMO_Display_Error(uint8_t PortNum, uint8_t ErrorType)
{
  uint8_t *pmsg;
  
  Display_clear_info();

