STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/ucpd/demo_application.c
#ifdef USBPD_REV30_SUPPORT
/**
  * @brief  ext capa menu display
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_extcapa_menu(uint8_t PortNum)
{
  uint8_t str[30];

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  /* Display menu source capa */
  sprintf((char *)str, "Extended capa : ");
  GUI_DisplayStringAt(0, 1 + 6 * Font12.Height, str, LEFT_MODE);

  Display_extcapa_menu_nav(PortNum, 0);
}

/**
  * @brief  ext capa menu navigation
  * @param  PortNum     The handle of the port
  * @param  Orientation Orientation
  * @retval None
  */
static void Display_extcapa_menu_nav(uint8_t PortNum, int8_t Orientation)
{
#if _SRC_CAPA_EXT
  uint8_t _str[16][20];
  uint8_t _max = 16;  /* Nb field inside extended capa */
  uint8_t _start, _end;

  memset(_str, ' ', sizeof(_str));

  sprintf((char *)_str[0], "VID:0x%x",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.VID);
  sprintf((char *)_str[1], "PID:0x%x",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PID);
  sprintf((char *)_str[2], "XID:0x%x",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.XID);
  sprintf((char *)_str[3], "F rev:0x%x",    DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.FW_revision);
  sprintf((char *)_str[4], "H rev:0x%x",    DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.HW_revision);
  sprintf((char *)_str[5], "V reg:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Voltage_regulation);
  sprintf((char *)_str[6], "Htime:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Holdup_time);
  sprintf((char *)_str[7], "Compliance:%d", DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Compliance);
  sprintf((char *)_str[8], "Tcurre:%d",     DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.TouchCurrent);
  sprintf((char *)_str[9], "Peak1:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PeakCurrent1);
  sprintf((char *)_str[10],"Peak2:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PeakCurrent2);
  sprintf((char *)_str[11],"Peak3:%d" ,     DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PeakCurrent3);
  sprintf((char *)_str[12],"Ttemp:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Touchtemp);
  sprintf((char *)_str[13],"SRCin:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Source_inputs);
  sprintf((char *)_str[14],"Nbbatt:%d",     DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.NbBatteries);
  sprintf((char *)_str[15],"PDP:%d",        DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.SourcePDP);

  for(int8_t i = 0; i < _max; i++)
  {
    uint8_t _size = strlen((char *)_str[i]);
    if(_size < 19 )
    {
      _str[i][_size] = ' ';
      _str[i][19] = '\0';
    }
  }

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  Menu_manage_selection(PortNum, _max, MAX_LINE_EXTCAPA, &_start, &_end, Orientation);

  for(int8_t index=_start; index < _end; index++)
  {

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      GUI_SetBackColor(GUI_COLOR_ST_PINK);
      GUI_SetTextColor(GUI_COLOR_WHITE);
    }

    GUI_DisplayStringAt(0, 1 + 6 * Font12.Height  + (index + 1 - _start) * Font16.Height,  (uint8_t*)_str[index], CENTER_MODE);

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      GUI_SetBackColor(GUI_COLOR_WHITE);
      GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
    }
  }
#endif /* _SRC_CAPA_EXT */
}
#else
static void Display_extcapa_menu(uint8_t PortNum)
{}

static void Display_extcapa_menu_nav(uint8_t PortNum, int8_t Orientation)
{}
#endif

/**
  * @brief  command menu display
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_command_menu(uint8_t PortNum)
{
  uint8_t _config = 0;
  uint8_t _countcommand = 0;

  /* Menu command display */
  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  if(USBPD_PORTPOWERROLE_SRC == DPM_Params[PortNum].PE_PowerRole) { _config = COMMANDROLE_SRC; }
  else { _config = COMMANDROLE_SNK; }
  if(USBPD_TRUE == DPM_Settings[PortNum].PE_RoleSwap ) _config|= COMMANDROLE_DRP;
  if(USBPD_TRUE == DPM_USER_Settings[PortNum].PE_VconnSwap) _config|= COMMANDROLE_VCONN;

  memset(g_tab_command_PORT[PortNum], 0, sizeof(typedef_COMMANDE)*DEMO_MAX_COMMAND);

  for(uint8_t index = 0; index < DEMO_MAX_COMMAND ;index++)
  {
     if(_config & g_tab_command_global[index].commandconfig)
     {
       memcpy((void *)&g_tab_command_PORT[PortNum][_countcommand], &g_tab_command_global[index], sizeof(typedef_COMMANDE));
       _countcommand++;
     }
  }

  /* Display menu command */
  GUI_DisplayStringAt(0, 1 + 6 * Font12.Height, (uint8_t *)"Commands :       ", LEFT_MODE);

  Display_command_menu_nav(PortNum, 0);
}

/**
  * @brief  command menu navigation
  * @param  PortNum     The handle of the port
  * @param  Nav         (+1 -1 or 0)
  * @retval None
  */
void Display_command_menu_nav(uint8_t PortNum, int8_t Nav)
{
  uint8_t _max = 0;
  uint8_t _start;
  uint8_t _end;

  /* count the max value */
  for(uint8_t index = 0; index < DEMO_MAX_COMMAND; index++)
  {
     if(COMMAND_NONE != g_tab_command_PORT[PortNum][index].commandid )
     {
       _max++;
     }
  }

  Menu_manage_selection(PortNum, _max, MAX_LINE_COMMAND, &_start, &_end, Nav);

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);


  for(int8_t index=_start; index < _end; index++)
  {
    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      GUI_SetBackColor(GUI_COLOR_ST_PINK);
      GUI_SetTextColor(GUI_COLOR_WHITE);
    }

    GUI_DisplayStringAt(0, 1 + 7 * Font12.Height  + (index + 1 - _start) * Font16.Height,  (uint8_t*)g_tab_command_PORT[PortNum][index].commandstr, CENTER_MODE);

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      GUI_SetBackColor(GUI_COLOR_WHITE);
      GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
    }
  }
}

/**
  * @brief  command menu execution
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_command_menu_exec(uint8_t PortNum)
{
  switch(g_tab_command_PORT[PortNum][g_tab_menu_sel[PortNum]].commandid)
  {
  case COMMAND_HARDRESET :
    USBPD_PE_Request_HardReset(PortNum);
    break;
  case COMMAND_CONTROLMSG_GOTOMIN :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GOTOMIN, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request gotomin");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_GET_SRC_CAP :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GET_SRC_CAP, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request srccapa");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_GET_SNK_CAP :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GET_SNK_CAP, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request snkcapa");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_DR_SWAP :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_DR_SWAP, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request drswap");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_PR_SWAP :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_PR_SWAP, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request prswap");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_VCONN_SWAP :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_VCONN_SWAP, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request vconnswap");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_SOFT_RESET :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_SOFT_RESET, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request swreset");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
#if defined(USBPD_REV30_SUPPORT)
  case COMMAND_CONTROLMSG_GET_SRC_CAPEXT :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GET_SRC_CAPEXT, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request extcapa");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_GET_STATUS :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GET_STATUS, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request status");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
#if defined(_VDM)
  case COMMAND_REQUEST_VDM_DISCOVERY :
    USBPD_DPM_RequestVDM_DiscoverySVID(PortNum, USBPD_SOPTYPE_SOP);
    break;
#endif
#endif /* USBPD_REV30_SUPPORT */
  default :
    break;
  }
}

/**
  * @brief  manage menu display
  * @param  PortNum     The handle of the port
  * @param  MenuSel     Selection of the menu
  * @retval None
  */
static void Display_menuupdate_info(uint8_t PortNum, DEMO_MENU MenuSel)
{
  Display_clear_info();
  switch(MenuSel)
  {
  default :
  case MENU_EMPTY : /* No Port connected so nothing to display */
/*    Display_build_info();*/
    break;
  case MENU_COMMAND : /* Display menu command */
    Display_command_menu(PortNum);
    break;
  case MENU_SOURCECAPA_RECEIVED : /* Display menu source capa */
    Display_sourcecapa_menu(PortNum);
    break;
  case MENU_SINKCAPA_RECEIVED : /* Display menu source capa */
    Display_sinkcapa_menu(PortNum);
    break;
  case MENU_BUILD :
    Display_build_info();
    break;
  case MENU_EXTCAPA_RECEIVED :
    Display_extcapa_menu(PortNum);
    break;
  case MENU_CABLE:
    Display_cableinfo_menu(PortNum);
    break;
  }
}

/**
  * @brief  manage menu selection
  * @param  PortNum     The handle of the port
  * @param  MenuSel     Selection of the menu
  * @param  Nav         (+1, -1, 0)
  * @retval None
  */
static void Display_menunav_info(uint8_t PortNum, uint8_t MenuSel, int8_t Nav)
{
  switch(MenuSel)
  {
  default :
  case MENU_EMPTY : /* No Port connected so nothing to display */
    break;
  case MENU_COMMAND : /* Display menu command */
    Display_command_menu_nav(PortNum, Nav);
    break;
  case MENU_SOURCECAPA_RECEIVED : /* Display menu source capa */
    Display_sourcecapa_menu_nav(PortNum, Nav);
    break;
  case MENU_SINKCAPA_RECEIVED : /* Display menu source capa */
    Display_sinkcapa_menu_nav(PortNum, Nav);
    break;
  case MENU_EXTCAPA_RECEIVED : /* Display menu source capa */
    Display_extcapa_menu_nav(PortNum, Nav);
    break;
  }
}

/**
  * @brief  manage menu execution
  * @param  PortNum     The handle of the port
  * @param  MenuSel     Selection of the menu
  * @retval None
  */
static void Display_menuexec_info(uint8_t PortNum, uint8_t MenuSel)
{
  switch(MenuSel)
  {
  default :
  case MENU_EMPTY : /* No Port connected so nothing to display */
    break;
  case MENU_COMMAND : /* Display menu command */
    Display_command_menu_exec(PortNum);
    break;
  case MENU_SOURCECAPA_RECEIVED : /* Display menu source capa */
    Display_sourcecapa_menu_exec(PortNum);
    break;
  }
}

/**
  * @brief  manage the debug port info display
  * @param  PortNum     The handle of the port
  * @param  msg         string to display
  * @retval None
  */
static void Display_debug_port(uint8_t PortNum, uint8_t *msg)
{
  uint32_t pos;
  static uint8_t TxtMessage[2][4][22];

  if (strlen((char*)msg) > 22)
  {
    /* Display not possible */
    sprintf((char*)TxtMessage[PortNum][3], "Display error\n");
    return;
  }

